{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a64cbc05-9988-4261-93c5-4af7ce59aee1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# requirements\n",
    "!pip install -q rdflib sparqlwrapper owlrl gdown pandas wikipedia-api"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2fa54075-b30d-4e94-9d41-5111cb90aaa3",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import pandas as pd\n",
    "import rdflib\n",
    "from rdflib import Graph, URIRef, Literal, BNode, Namespace, RDF, FOAF, RDFS, XSD, term \n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import urllib.parse\n",
    "from rdflib.plugins.sparql import prepareQuery\n",
    "from dateutil import parser\n",
    "from rdflib import Namespace\n",
    "from requests.exceptions import ReadTimeout\n",
    "import time\n",
    "import gdown\n",
    "import wikipediaapi\n",
    "import re\n",
    "import owlrl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c86133b5-6fe3-4223-90e8-7349d8d4f6c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# create directory for data\n",
    "if not os.path.exists(\"./data/\"):\n",
    "    os.mkdir(\"./data/\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "21a73c00-3fbe-4a50-9f5b-f8d6e077bb67",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'./data/albumlist.csv'"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Download data\n",
    "gdown.download(id=\"1UILSMenvqzFMsIhV6l4ZV1opJpRQZnwC\", output=\"./data/rym_top_5000_all_time.csv\", quiet=True)\n",
    "gdown.download(id=\"1UNJ2iDX-xoWIekSA0ZwoqNOk3eAZjqrp\", output=\"./data/albumlist.csv\", quiet=True)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "0715d141-bac3-4529-946e-4776452e88fe",
   "metadata": {
    "tags": []
   },
   "source": [
    "# **KRR Module 2 2022/23 Project**\n",
    "\n",
    "The project consists in the creation of an RDF knowledge graph starting from tabular data (two CSV files loaded below).\n",
    "\n",
    "You should cover all of the following steps."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "64fdd5ae-67d2-4ce3-88af-6373858335e4",
   "metadata": {},
   "source": [
    "### **`1. Create an RDFLib Graph from data contained in CSV files`**\n",
    "\n",
    "In steps:\n",
    "1) Load the CSV files in two pandas DataFrames and join them\n",
    "2) Create an RDFLib `Graph` and add triples from the data of the dataframes"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "9a535cbc-bb72-406e-8944-2b2f30dc94dc",
   "metadata": {
    "tags": []
   },
   "source": [
    "Useful links:\n",
    "\n",
    "- [Pandas user guide](https://pandas.pydata.org/docs/user_guide/index.html) and [documentation](https://pandas.pydata.org/docs/reference/), e.g.:\n",
    "    - [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html)\n",
    "    - [Join dataframes](https://pandas.pydata.org/docs/user_guide/10min.html#join)\n",
    "    - [Splitting and replacing strings](https://pandas.pydata.org/docs/user_guide/text.html#splitting-and-replacing-strings)\n",
    "    - [Apply a function over an axis of a DataFrame](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html?highlight=apply#pandas.DataFrame.apply)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "530f8ed4-604e-4489-93c5-425372ae6745",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Number</th>\n",
       "      <th>Year</th>\n",
       "      <th>Album</th>\n",
       "      <th>Artist</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Subgenre</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1967</td>\n",
       "      <td>Sgt. Pepper's Lonely Hearts Club Band</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Rock &amp; Roll, Psychedelic Rock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>1966</td>\n",
       "      <td>Pet Sounds</td>\n",
       "      <td>The Beach Boys</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Pop Rock, Psychedelic Rock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>1966</td>\n",
       "      <td>Revolver</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Psychedelic Rock, Pop Rock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>1965</td>\n",
       "      <td>Highway 61 Revisited</td>\n",
       "      <td>Bob Dylan</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Folk Rock, Blues Rock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>1965</td>\n",
       "      <td>Rubber Soul</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock, Pop</td>\n",
       "      <td>Pop Rock</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Number  Year                                  Album          Artist  \\\n",
       "0       1  1967  Sgt. Pepper's Lonely Hearts Club Band     The Beatles   \n",
       "1       2  1966                             Pet Sounds  The Beach Boys   \n",
       "2       3  1966                               Revolver     The Beatles   \n",
       "3       4  1965                   Highway 61 Revisited       Bob Dylan   \n",
       "4       5  1965                            Rubber Soul     The Beatles   \n",
       "\n",
       "       Genre                       Subgenre  \n",
       "0       Rock  Rock & Roll, Psychedelic Rock  \n",
       "1       Rock     Pop Rock, Psychedelic Rock  \n",
       "2       Rock     Psychedelic Rock, Pop Rock  \n",
       "3       Rock          Folk Rock, Blues Rock  \n",
       "4  Rock, Pop                       Pop Rock  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df1 = pd.read_csv('data/albumlist.csv', encoding='mac_roman')\n",
    "df1.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4c614dab-619c-455c-bd63-565ff79619e9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Ranking</th>\n",
       "      <th>Album</th>\n",
       "      <th>Artist Name</th>\n",
       "      <th>Release Date</th>\n",
       "      <th>Genres</th>\n",
       "      <th>Descriptors</th>\n",
       "      <th>Average Rating</th>\n",
       "      <th>Number of Ratings</th>\n",
       "      <th>Number of Reviews</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>OK Computer</td>\n",
       "      <td>Radiohead</td>\n",
       "      <td>16 June 1997</td>\n",
       "      <td>Alternative Rock, Art Rock</td>\n",
       "      <td>melancholic, anxious, futuristic, alienation, ...</td>\n",
       "      <td>4.23</td>\n",
       "      <td>70,382</td>\n",
       "      <td>1531</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2.0</td>\n",
       "      <td>Wish You Were Here</td>\n",
       "      <td>Pink Floyd</td>\n",
       "      <td>12 September 1975</td>\n",
       "      <td>Progressive Rock, Art Rock</td>\n",
       "      <td>melancholic, atmospheric, progressive, male vo...</td>\n",
       "      <td>4.29</td>\n",
       "      <td>48,662</td>\n",
       "      <td>983</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3.0</td>\n",
       "      <td>In the Court of the Crimson King</td>\n",
       "      <td>King Crimson</td>\n",
       "      <td>10 October 1969</td>\n",
       "      <td>Progressive Rock, Art Rock</td>\n",
       "      <td>fantasy, epic, progressive, philosophical, com...</td>\n",
       "      <td>4.30</td>\n",
       "      <td>44,943</td>\n",
       "      <td>870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4.0</td>\n",
       "      <td>Kid A</td>\n",
       "      <td>Radiohead</td>\n",
       "      <td>3 October 2000</td>\n",
       "      <td>Art Rock, Experimental Rock, Electronic</td>\n",
       "      <td>cold, melancholic, futuristic, atmospheric, an...</td>\n",
       "      <td>4.21</td>\n",
       "      <td>58,590</td>\n",
       "      <td>734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5.0</td>\n",
       "      <td>To Pimp a Butterfly</td>\n",
       "      <td>Kendrick Lamar</td>\n",
       "      <td>15 March 2015</td>\n",
       "      <td>Conscious Hip Hop, West Coast Hip Hop, Jazz Rap</td>\n",
       "      <td>political, conscious, poetic, protest, concept...</td>\n",
       "      <td>4.27</td>\n",
       "      <td>44,206</td>\n",
       "      <td>379</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Ranking                             Album     Artist Name  \\\n",
       "0      1.0                       OK Computer       Radiohead   \n",
       "1      2.0                Wish You Were Here      Pink Floyd   \n",
       "2      3.0  In the Court of the Crimson King    King Crimson   \n",
       "3      4.0                             Kid A       Radiohead   \n",
       "4      5.0               To Pimp a Butterfly  Kendrick Lamar   \n",
       "\n",
       "        Release Date                                           Genres  \\\n",
       "0       16 June 1997                       Alternative Rock, Art Rock   \n",
       "1  12 September 1975                       Progressive Rock, Art Rock   \n",
       "2    10 October 1969                       Progressive Rock, Art Rock   \n",
       "3     3 October 2000          Art Rock, Experimental Rock, Electronic   \n",
       "4      15 March 2015  Conscious Hip Hop, West Coast Hip Hop, Jazz Rap   \n",
       "\n",
       "                                         Descriptors  Average Rating  \\\n",
       "0  melancholic, anxious, futuristic, alienation, ...            4.23   \n",
       "1  melancholic, atmospheric, progressive, male vo...            4.29   \n",
       "2  fantasy, epic, progressive, philosophical, com...            4.30   \n",
       "3  cold, melancholic, futuristic, atmospheric, an...            4.21   \n",
       "4  political, conscious, poetic, protest, concept...            4.27   \n",
       "\n",
       "  Number of Ratings  Number of Reviews  \n",
       "0            70,382               1531  \n",
       "1            48,662                983  \n",
       "2            44,943                870  \n",
       "3            58,590                734  \n",
       "4            44,206                379  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df2 = pd.read_csv('data/rym_top_5000_all_time.csv')\n",
    "df2.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "621c566f-64b4-47a7-be9b-f4869942bfcf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((500, 6), (5000, 9))"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df1.shape, df2.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "3e16e710-7e72-4c0b-9be0-f5a6dfa144f3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Number</th>\n",
       "      <th>Year</th>\n",
       "      <th>Album</th>\n",
       "      <th>Artist</th>\n",
       "      <th>Genre</th>\n",
       "      <th>Subgenre</th>\n",
       "      <th>Ranking</th>\n",
       "      <th>Artist Name</th>\n",
       "      <th>Release Date</th>\n",
       "      <th>Genres</th>\n",
       "      <th>Descriptors</th>\n",
       "      <th>Average Rating</th>\n",
       "      <th>Number of Ratings</th>\n",
       "      <th>Number of Reviews</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>1967.0</td>\n",
       "      <td>Sgt. Pepper's Lonely Hearts Club Band</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Rock &amp; Roll, Psychedelic Rock</td>\n",
       "      <td>24.0</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>1 June 1967</td>\n",
       "      <td>Psychedelic Pop, Pop Rock</td>\n",
       "      <td>psychedelic, playful, melodic, male vocals, wa...</td>\n",
       "      <td>4.13</td>\n",
       "      <td>43,576</td>\n",
       "      <td>863.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2.0</td>\n",
       "      <td>1966.0</td>\n",
       "      <td>Pet Sounds</td>\n",
       "      <td>The Beach Boys</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Pop Rock, Psychedelic Rock</td>\n",
       "      <td>20.0</td>\n",
       "      <td>The Beach Boys</td>\n",
       "      <td>16 May 1966</td>\n",
       "      <td>Baroque Pop</td>\n",
       "      <td>Wall of Sound, warm, bittersweet, love, romant...</td>\n",
       "      <td>4.18</td>\n",
       "      <td>36,305</td>\n",
       "      <td>727.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3.0</td>\n",
       "      <td>1966.0</td>\n",
       "      <td>Revolver</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Psychedelic Rock, Pop Rock</td>\n",
       "      <td>11.0</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>5 August 1966</td>\n",
       "      <td>Pop Rock, Psychedelic Pop</td>\n",
       "      <td>psychedelic, melodic, male vocals, drugs, ecle...</td>\n",
       "      <td>4.23</td>\n",
       "      <td>43,178</td>\n",
       "      <td>1160.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4.0</td>\n",
       "      <td>1965.0</td>\n",
       "      <td>Highway 61 Revisited</td>\n",
       "      <td>Bob Dylan</td>\n",
       "      <td>Rock</td>\n",
       "      <td>Folk Rock, Blues Rock</td>\n",
       "      <td>35.0</td>\n",
       "      <td>Bob Dylan</td>\n",
       "      <td>30 August 1965</td>\n",
       "      <td>Folk Rock, Singer/Songwriter</td>\n",
       "      <td>poetic, cryptic, surreal, sarcastic, male voca...</td>\n",
       "      <td>4.17</td>\n",
       "      <td>26,338</td>\n",
       "      <td>604.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5.0</td>\n",
       "      <td>1965.0</td>\n",
       "      <td>Rubber Soul</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>Rock, Pop</td>\n",
       "      <td>Pop Rock</td>\n",
       "      <td>73.0</td>\n",
       "      <td>The Beatles</td>\n",
       "      <td>3 December 1965</td>\n",
       "      <td>Pop Rock</td>\n",
       "      <td>melodic, love, male vocals, bittersweet, roman...</td>\n",
       "      <td>4.03</td>\n",
       "      <td>33,508</td>\n",
       "      <td>721.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Number    Year                                  Album          Artist  \\\n",
       "0     1.0  1967.0  Sgt. Pepper's Lonely Hearts Club Band     The Beatles   \n",
       "1     2.0  1966.0                             Pet Sounds  The Beach Boys   \n",
       "2     3.0  1966.0                               Revolver     The Beatles   \n",
       "3     4.0  1965.0                   Highway 61 Revisited       Bob Dylan   \n",
       "4     5.0  1965.0                            Rubber Soul     The Beatles   \n",
       "\n",
       "       Genre                       Subgenre  Ranking     Artist Name  \\\n",
       "0       Rock  Rock & Roll, Psychedelic Rock     24.0     The Beatles   \n",
       "1       Rock     Pop Rock, Psychedelic Rock     20.0  The Beach Boys   \n",
       "2       Rock     Psychedelic Rock, Pop Rock     11.0     The Beatles   \n",
       "3       Rock          Folk Rock, Blues Rock     35.0       Bob Dylan   \n",
       "4  Rock, Pop                       Pop Rock     73.0     The Beatles   \n",
       "\n",
       "      Release Date                        Genres  \\\n",
       "0      1 June 1967     Psychedelic Pop, Pop Rock   \n",
       "1      16 May 1966                   Baroque Pop   \n",
       "2    5 August 1966     Pop Rock, Psychedelic Pop   \n",
       "3   30 August 1965  Folk Rock, Singer/Songwriter   \n",
       "4  3 December 1965                      Pop Rock   \n",
       "\n",
       "                                         Descriptors  Average Rating  \\\n",
       "0  psychedelic, playful, melodic, male vocals, wa...            4.13   \n",
       "1  Wall of Sound, warm, bittersweet, love, romant...            4.18   \n",
       "2  psychedelic, melodic, male vocals, drugs, ecle...            4.23   \n",
       "3  poetic, cryptic, surreal, sarcastic, male voca...            4.17   \n",
       "4  melodic, love, male vocals, bittersweet, roman...            4.03   \n",
       "\n",
       "  Number of Ratings  Number of Reviews  \n",
       "0            43,576              863.0  \n",
       "1            36,305              727.0  \n",
       "2            43,178             1160.0  \n",
       "3            26,338              604.0  \n",
       "4            33,508              721.0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Continue here ...\n",
    "df3_join = pd.merge(df1, df2,how='outer')\n",
    "df3_join.head()\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "f6082a8d-8b55-4629-b270-2b139523c7b9",
   "metadata": {
    "tags": []
   },
   "source": [
    "Create an RDFLib `Graph` and add triples from the data of the dataframes**\n",
    "\n",
    "For example, add triples like the following (but not only):\n",
    "\n",
    "- `[album] dbp:artist [artist]`,\n",
    "- `[album] rdfs:label [album_name]`,\n",
    "- `[album] rdf:type [genre]`\n",
    "\n",
    "Make sure you use URIs and Literals correctly."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b7e3fadc",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create the RDFLib Graph\n",
    "rdf_graph = rdflib.Graph()\n",
    "\n",
    "# Define your custom namespace\n",
    "ex = Namespace('http://example.org/')\n",
    "dbp = Namespace('http://dbpedia.org/property/')\n",
    "rdfs = Namespace('http://www.w3.org/2000/01/rdf-schema#')\n",
    "dbr = Namespace('http://dbpedia.org/resource/')\n",
    "dbo = Namespace('http://dbpedia.org/ontology/')\n",
    "rdf = Namespace(\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\")\n",
    "\n",
    "# Bind the namespaces to prefixes in the graph\n",
    "rdf_graph.bind(\"ex\", ex)\n",
    "rdf_graph.bind(\"dbo\", dbo)\n",
    "rdf_graph.bind(\"dbp\", dbp)\n",
    "rdf_graph.bind(\"rdf\", RDF)\n",
    "rdf_graph.bind(\"rdfs\", RDFS)\n",
    "sparql_endpoint = \"http://dbpedia.org/sparql\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "941d20bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define the file path for the RDF graph try to use it to avoid time ofc using proper graph db would be efficient \n",
    "file_path = \"1.ttl\"\n",
    "\n",
    "# Check if the file already exists\n",
    "if os.path.exists(file_path):\n",
    "    pass\n",
    "else:\n",
    "    # Load dataframe (df3_join) with the required columns: 'Artist Name', 'Album', 'Genre', 'Release Date', 'Genres', 'Average Rating'\n",
    "\n",
    "    # Iterate over the dataframe rows and add triples to the graph\n",
    "    for index, row in df3_join.iterrows():\n",
    "        artist_name = row['Artist Name']\n",
    "        album_name = row['Album']\n",
    "        genre_name = row['Genre']\n",
    "        release_date = row['Release Date']\n",
    "        genres = row['Genres']\n",
    "        average_rating = row['Average Rating']\n",
    "        \n",
    "        if not pd.isnull(artist_name):\n",
    "            artist = URIRef(dbr[urllib.parse.quote(artist_name.replace(' ', '_'))])\n",
    "        if not pd.isnull(album_name):\n",
    "            album = URIRef(dbr[urllib.parse.quote(album_name.replace(' ', '_'))])\n",
    "        if not pd.isnull(genre_name):\n",
    "            genre = URIRef(ex[urllib.parse.quote(genre_name.replace(' ', '_'))])\n",
    "        if not pd.isnull(genres):\n",
    "            genres = URIRef(ex[urllib.parse.quote(genres.replace(' ', '_'))])\n",
    "\n",
    "        try:\n",
    "            if not pd.isnull(release_date):\n",
    "                # Try to parse the release date using dateutil.parser\n",
    "                parsed_date = parser.parse(release_date)\n",
    "                xsd_date = rdflib.Literal(parsed_date.date(), datatype=rdflib.XSD.date)\n",
    "        except (ValueError, OverflowError):\n",
    "            # If parsing fails, add the release date as a string\n",
    "            xsd_date = rdflib.Literal(release_date)\n",
    "\n",
    "        rdf_graph.add((album, dbp.artist, artist))\n",
    "        rdf_graph.add((album, rdfs.label, rdflib.Literal(album_name)))\n",
    "        rdf_graph.add((album, dbp.releaseDate, xsd_date))\n",
    "        rdf_graph.add((album, dbp.averageRating, rdflib.Literal(average_rating)))\n",
    "        if not pd.isnull(genres):\n",
    "            rdf_graph.add((genres, RDFS.subClassOf, genre))\n",
    "        rdf_graph.add((album, RDF.type, genre))\n",
    "        rdf_graph.add((album, RDF.type, dbo.MusicAlbum))\n",
    "\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "b65cd562",
   "metadata": {},
   "source": [
    "### **`2. Integrate your data with DBpedia's`**\n",
    "                                                                                                                                                               \n",
    "You MUST extend the knowledge you already have on your local KG with the following from DBpedia:     \n",
    "- band members\n",
    "- city of birth of members\n",
    "- country of birth of members\n",
    "- founding city of the band\n",
    "- founding country of the band     \n",
    "\n",
    "You can also add more information regarding albums (optional)\n",
    "\n",
    "\n",
    "\n",
    "Recommendations and hints: \n",
    "- How to find IRIs from DBpedia that match the entities in the local KG?\n",
    "  1) guessing the IRI with simple tricks:\n",
    "     - the album 'Rubber Soul' on DBpedia is `dbr:Rubber_Soul`, and this 'translation' may work for other albums (don't do it manually) \n",
    "     - the album 'Led Zeppelin' on DBpedia is `dbr:Led_Zeppelin_(album)` as the same name is also associated to the band\n",
    "  2) through their `rdfs:label`: for instance, the artist [Amy Winehouse](https://en.wikipedia.org/wiki/Amy_Winehouse) has 'Amy Winehouse' as label on DBpedia and therfore after the matching the IRI of the entity can be extracted\n",
    "  3) using the [DBpedia lookup endpoint](https://github.com/dbpedia/lookup). The following request tries to find the DBpedia entity for the artist [Fabrizio De Andrè](https://en.wikipedia.org/wiki/Fabrizio_De_Andr%C3%A9): https://lookup.dbpedia.org/api/search/KeywordSearch?QueryString=fabrizio%20de%20andre&format=json&MaxHits=5\n",
    "- restrict the search to entities of type 'Album', 'Band', 'country', etc, in order to avoid overloading DBPedia's endpoint (see [here](http://mappings.dbpedia.org/server/ontology/classes/) for a list of DBPedia classes) and thus avoid high latency or being banned      \n",
    "- note that sometimes useful properties to reach entities have the `dbp` prefix which is different from `dbo` ([more info](https://parklize.blogspot.com/2016/05/dbpedia-difference-between-dbo-and-dbp.html)). It's ok to use both\n",
    "- here is a **non-exaustive** list of useful properties: `dbp:hometown`, `dbo:birthPlace`, `dbo:country`, `dbo:formerBandMember`\n",
    "- how to find properties that link two entities of our interest?\n",
    "  1) by checking the [DBpedia ontology](https://akswnc7.informatik.uni-leipzig.de/dstreitmatter/archivo/dbpedia.org/ontology/2023.05.12-020000/ontology_type=parsed.owl) manually\n",
    "  2) by checking the DBpedia ontology with Protégé\n",
    "  3) using the DBpedia resource pages and exploiting your knowledge (or Wikipedia information). For instance, let us consider [Metallica](https://en.wikipedia.org/wiki/Metallica), I know that [Dave Mustaine](https://en.wikipedia.org/wiki/Dave_Mustaine) was a member, therefore I ask myself: How are these two entities linked in the DBpedia KG? On the [DBpedia page of Metallica](https://dbpedia.org/page/Metallica) we can find that the property used is `dbo:formerBandMember` thus I can use this property to get band members \n",
    "  4) running SPARQL queries like the following in the DBpedia endpoint:\n",
    "      ```\n",
    "      SELECT DISTINCT ?p\n",
    "      WHERE {\n",
    "        ?s a dbo:Band .\n",
    "        ?o a dbo:MusicalArtist .\n",
    "        ?s ?p ?o .\n",
    "      }\n",
    "      ```\n",
    "  5) if you are curious enough you can check [ABSTAT](http://abstat.disco.unimib.it/about.html), a tool for KG exploration with a nice interface\n",
    "- please notice that DBpedia is not perfect so is reccomendable to check the type of the candidates before including them"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "57c74c0b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# can take up to 3 hours depends on the internet and the pc , recommendation deploy server would be better than querying dbpedia faster\n",
    "# since will contain only small graph and more limited to the university so the connection rate is more \n",
    "if not os.path.exists(file_path):     \n",
    "    #  file doesn't exist, perform SPARQL queries and add data to the graph\n",
    "\n",
    "    # Initialize SPARQL wrapper\n",
    "    sparql = SPARQLWrapper(\"https://dbpedia.org/sparql\")\n",
    "\n",
    "    # Define the query template\n",
    "    query_template = '''\n",
    "        PREFIX dbp: <http://dbpedia.org/property/>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "\n",
    "        ASK\n",
    "        WHERE {{\n",
    "            {{\n",
    "                {{ <{artist}> a dbo:Band . }}\n",
    "                UNION\n",
    "                {{ <{artist}> dbo:wikiPageRedirects ?redirectedArtist . ?redirectedArtist a dbo:Band . }}\n",
    "            }}\n",
    "            UNION\n",
    "            {{\n",
    "                {{ <{artist}> a dbo:Person . FILTER NOT EXISTS {{ <{artist}> a dbo:Band }} }}\n",
    "                UNION\n",
    "                {{ <{artist}> dbo:wikiPageRedirects ?redirectedArtist . ?redirectedArtist a dbo:Person . FILTER NOT EXISTS {{ ?redirectedArtist a dbo:Band }} }}\n",
    "            }}\n",
    "        }}\n",
    "    '''\n",
    "\n",
    "    # Define a sample size\n",
    "    sample_size = 100\n",
    "\n",
    "    # Get a random sample from the dataframe\n",
    "    df_sample = df3_join.sample(n=sample_size)  # was for fast debugging\n",
    "\n",
    "    # Iterate over the sample rows and query DBpedia for additional information\n",
    "    for index, row in df3_join.iterrows():\n",
    "        artist_name = row['Artist Name']\n",
    "\n",
    "        # Create the artist URI\n",
    "        if not pd.isnull(artist_name):\n",
    "            artist_uri = \"http://dbpedia.org/resource/\" + urllib.parse.quote(artist_name.replace(' ', '_'))\n",
    "\n",
    "            # Prepare the SPARQL query\n",
    "            query = query_template.format(artist=artist_uri)\n",
    "            sparql.setQuery(query)\n",
    "            sparql.setReturnFormat(JSON)\n",
    "\n",
    "            # use try-except to catch any error\n",
    "            try:\n",
    "                # Execute the query and process the result\n",
    "                result = sparql.query().convert()\n",
    "                is_band = result[\"boolean\"]\n",
    "\n",
    "                if is_band:\n",
    "                    # The artist is a band, execute the band-related queries\n",
    "                    band_query = '''\n",
    "                        PREFIX dbp: <http://dbpedia.org/property/>\n",
    "                        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                        PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "\n",
    "                        SELECT DISTINCT ?member ?birthplace ?member_country ?founding_city ?founding_country\n",
    "                        WHERE {{\n",
    "                            {{\n",
    "                                <{artist}> a dbo:Band ;\n",
    "                                            dbo:formerBandMember ?member .\n",
    "                            }}\n",
    "                            UNION\n",
    "                            {{\n",
    "                                <{artist}> dbo:wikiPageRedirects ?redirectedArtist .\n",
    "                                ?redirectedArtist a dbo:Band ;\n",
    "                                                dbo:formerBandMember ?member .\n",
    "                            }}\n",
    "                            OPTIONAL {{ ?member dbo:birthPlace ?birthplace .}}\n",
    "                            OPTIONAL {{ ?birthplace dbo:country ?member_country .}}\n",
    "                            OPTIONAL {{ <{artist}> dbo:hometown ?founding_city.}}\n",
    "                            OPTIONAL {{ ?redirectedArtist dbo:hometown ?founding_city.}}\n",
    "                            OPTIONAL {{ ?founding_city dbo:country ?founding_country.}}\n",
    "                        }} LIMIT 7\n",
    "                    '''\n",
    "\n",
    "                    # Prepare the band-related SPARQL query\n",
    "                    band_query = band_query.format(artist=artist_uri)\n",
    "                    sparql.setQuery(band_query)\n",
    "                    sparql.setReturnFormat(JSON)\n",
    "\n",
    "                    # Execute the query and process the results\n",
    "                    results = sparql.query().convert()\n",
    "                    for result in results[\"results\"][\"bindings\"]:\n",
    "                        member_uri = result.get(\"member\", {}).get(\"value\")\n",
    "                        birthplace = result.get(\"birthplace\", {}).get(\"value\")\n",
    "                        member_country = result.get(\"member_country\", {}).get(\"value\")\n",
    "                        founding_city = result.get(\"founding_city\", {}).get(\"value\")\n",
    "                        founding_country = result.get(\"founding_country\", {}).get(\"value\")\n",
    "\n",
    "                        # Add the additional information to the graph\n",
    "                        if member_uri:\n",
    "                            rdf_graph.add((rdflib.URIRef(artist_uri), dbp.formerBandMember, rdflib.URIRef(member_uri)))\n",
    "\n",
    "                        if birthplace:\n",
    "                            rdf_graph.add((rdflib.URIRef(member_uri), dbp.birthPlace, rdflib.URIRef(birthplace)))\n",
    "\n",
    "                        if member_country:\n",
    "                            rdf_graph.add((rdflib.URIRef(member_uri), dbp.birthCountry, rdflib.URIRef(member_country)))\n",
    "\n",
    "                        if founding_city:\n",
    "                            rdf_graph.add((rdflib.URIRef(artist_uri), dbp.hometown, rdflib.URIRef(founding_city)))\n",
    "\n",
    "                        if founding_country:\n",
    "                            rdf_graph.add((rdflib.URIRef(artist_uri), dbp.founding_country, rdflib.URIRef(founding_country)))\n",
    "                        \n",
    "                else:\n",
    "                    # The artist is not a band, execute the artist-related queries\n",
    "                    artist_query = '''\n",
    "                        PREFIX dbp: <http://dbpedia.org/property/>\n",
    "                        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "                        PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "\n",
    "                        SELECT DISTINCT ?birthplace ?member_country\n",
    "                        WHERE {{\n",
    "                            {{\n",
    "                                <{artist}> a dbo:Person ;\n",
    "                                            dbo:birthPlace ?birthplace .\n",
    "                            }}\n",
    "                            UNION\n",
    "                            {{\n",
    "                                <{artist}> dbo:wikiPageRedirects ?redirectedArtist .\n",
    "                                ?redirectedArtist a dbo:Person ;\n",
    "                                                dbo:birthPlace ?birthplace .\n",
    "                            }}\n",
    "                            ?birthplace dbo:country ?member_country .\n",
    "                            FILTER NOT EXISTS {{ <{artist}> a dbo:Band }}\n",
    "                        }} LIMIT 7\n",
    "                    '''\n",
    "\n",
    "                    # Prepare the artist-related SPARQL query\n",
    "                    artist_query = artist_query.format(artist=artist_uri)\n",
    "                    sparql.setQuery(artist_query)\n",
    "                    sparql.setReturnFormat(JSON)\n",
    "\n",
    "                    # Execute the query and process the results\n",
    "                    results = sparql.query().convert()\n",
    "                    for result in results[\"results\"][\"bindings\"]:\n",
    "                        birthplace = result.get(\"birthplace\", {}).get(\"value\")\n",
    "                        member_country = result.get(\"member_country\", {}).get(\"value\")\n",
    "\n",
    "                        # Add the additional information to the graph\n",
    "                        if birthplace:\n",
    "                            rdf_graph.add((rdflib.URIRef(artist_uri), dbp.birthPlace, rdflib.URIRef(birthplace)))\n",
    "\n",
    "                        if member_country:\n",
    "                            rdf_graph.add((rdflib.URIRef(artist_uri), dbp.birthCountry, rdflib.URIRef(member_country)))\n",
    "\n",
    "            except Exception as e:\n",
    "                print(f\"Error occurred for artist '{artist_name}': {str(e)}\")\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "6c66fbc6",
   "metadata": {},
   "source": [
    "### **`3. Gathering Information from unstructured data`**\n",
    "\n",
    "Knowledge can be gathered from unstructured data as well as structured data. A great encyclopaedic source is Wikipedia whose articles follow a very strict pattern. For instance, the first lines about a Person are reserved for biographical data and his or her occupation, therefore we can exploit it to understand the role of a band member and add this information to our KG.\n",
    "\n",
    "In steps:\n",
    "1) get the article from Wikipedia and extract the summary. You can use [Wikipedia-api](https://pypi.org/project/Wikipedia-API/) (see the code below)\n",
    "2) extract the band member role (guitarist, bassist, keyboardist, singer, drummer, etc) using rules\n",
    "3) add this information to the KG\n",
    "\n",
    "Recommendations and hints: \n",
    "- some artists have multiple roles, add them all\n",
    "- some artists have multiple bands, it is not required to understand the role for each band, keep it simple.\n",
    "- extraction rules can be very simple (simple string matchers + if-else)  or more complex ones (e.g., regex, ChatGPT requests), it doesn't matter in terms of points.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "a2b3e872",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Page - Summary: Kurt Donald Cobain (February 20, 1967 – c. April 5, 1994) was an American musician who was the co-founder, lead vocalist, guitarist and primary songwriter of the rock band Nirvana. Through his angst-f\n"
     ]
    }
   ],
   "source": [
    "import wikipediaapi\n",
    "\n",
    "wiki_wiki = wikipediaapi.Wikipedia('en')\n",
    "page_py = wiki_wiki.page('Kurt Cobain')\n",
    "\n",
    "if page_py.exists():\n",
    "    summary = page_py.summary[:200]\n",
    "    print(\"Page - Summary: %s\" % summary)\n",
    "else:\n",
    "    print(\"Page does not exist.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "87b18550",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize Wikipedia API\n",
    "wiki_wiki = wikipediaapi.Wikipedia('en')\n",
    "\n",
    "# Check if the  file exists\n",
    "if not os.path.exists(file_path):\n",
    "\n",
    "    # Regular expression pattern for band member roles\n",
    "    role_pattern = r\"\\b(guitarist|bassist|keyboardist|singer|drummer|DJ|artist|musician|rapper|producer|composer|vocalist|pianist|violinist|cellist|percussionist)\\b\"\n",
    "\n",
    "    # SPARQL query to retrieve the former band members\n",
    "    sparql_query = \"\"\"\n",
    "        PREFIX dbp: <http://dbpedia.org/property/>\n",
    "        PREFIX ex: <http://example.org/role/>\n",
    "        SELECT ?artist ?member\n",
    "        WHERE {\n",
    "            ?artist dbp:formerBandMember ?member .\n",
    "        }\n",
    "    \"\"\"\n",
    "\n",
    "    # Execute the SPARQL query on the RDF graph\n",
    "    results = rdf_graph.query(sparql_query)\n",
    "\n",
    "    # Loop through the SPARQL query results\n",
    "    for row in results:\n",
    "        artist_uri, member_uri = row\n",
    "\n",
    "        # Extract the artist name and member name from the URIs\n",
    "        artist_name = str(artist_uri).split(\"/\")[-1]\n",
    "        member_name = str(member_uri).split(\"/\")[-1]\n",
    "\n",
    "        retries = 3  # Number of retries if a timeout occurs\n",
    "        for retry in range(retries):\n",
    "            try:\n",
    "                # Retrieve the Wikipedia page\n",
    "                page_py = wiki_wiki.page(member_name)\n",
    "\n",
    "                # Check if the page exists\n",
    "                if page_py.exists():\n",
    "                    # Get the summary of the page\n",
    "                    summary = page_py.summary\n",
    "\n",
    "                    # Find all band member roles in the summary\n",
    "                    roles = re.findall(role_pattern, summary)\n",
    "\n",
    "                    # Update the graph with the roles for the current member\n",
    "                    member_uri = URIRef(member_uri)\n",
    "                    for role in roles:\n",
    "                        role_uri = URIRef(\"http://example.org/role/{}\".format(role))\n",
    "                        rdf_graph.add((member_uri, URIRef(\"http://dbpedia.org/ontology/hasrole\"), role_uri))\n",
    "\n",
    "                    break  # Break the retry loop if successful\n",
    "\n",
    "                else:\n",
    "                    print(\"Page for {} does not exist.\".format(member_name))\n",
    "\n",
    "            except ReadTimeout:\n",
    "                if retry == retries - 1:\n",
    "                    print(\"Timeout occurred while retrieving page for {}. Retries exhausted.\".format(member_name))\n",
    "                else:\n",
    "                    print(\"Timeout occurred while retrieving page for {}. Retrying...\".format(member_name))\n",
    "                    time.sleep(1)  # Wait for a while before retrying\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "03677112-ebe7-4ec8-9bfa-16380b6fcb60",
   "metadata": {},
   "source": [
    "### **`4. Include a small ontology and a  genres taxonomy`**\n",
    "\n",
    "Using RDFlib, add classes such as Person, MusicAlbum, and so on to your KG. Add the domain and range for each property you use.\n",
    "\n",
    "This will be needed later for inferring the types of the entities of your KG."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "6852286c-1b1e-4f92-af95-30c9a1f08711",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nfe362c4c4fdd4aa580a37be148785952 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Your solution ...\n",
    "rdf_graph.add((ex.role, RDF.type, RDFS.Class))\n",
    "rdf_graph.add((ex.country, RDF.type, RDFS.Class))\n",
    "rdf_graph.add((dbo.Person, RDF.type, RDFS.Class))\n",
    "rdf_graph.add((dbo.Band, RDF.type, RDFS.Class))\n",
    "rdf_graph.add((dbo.MusicAlbum, RDF.type, RDFS.Class))\n",
    "rdf_graph.add((dbp.formerBandMember, RDF.type, RDF.Property))\n",
    "rdf_graph.add((dbp.founding_country , RDF.type, RDF.Property))\n",
    "rdf_graph.add((dbp.hometown, RDF.type, RDF.Property))\n",
    "rdf_graph.add((dbp.birthPlace, RDF.type, RDF.Property))\n",
    "rdf_graph.add((dbp.birthCountry, RDF.type, RDF.Property))\n",
    "rdf_graph.add((dbo.hasrole, RDF.type, RDF.Property))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "06f89ab2-6eb5-4d14-9366-59f4da8603b2",
   "metadata": {},
   "source": [
    "Moreover, the first dataframe has 'Genre' and 'Subgenre' columns.\n",
    "Extract a genres taxonomy from the dataset and include it in your RDF KG. This will be needed later for inferring genres from subgenres.\n",
    "\n",
    "E.g.: add triples to the graph like:\n",
    "\n",
    "- `[subgenre] rdfs:subClassOf [genre]`.\n",
    "- `[album] rdf:type [genre]`.\n",
    "\n",
    "This should be done for all genres and subgenres (with an iteration, not manually)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "fae17a86-20ae-4ad1-aa92-f678dd6dc53a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nfe362c4c4fdd4aa580a37be148785952 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Your solution ...\n",
    "#subClassof was added in the for loop in the upper cells\n",
    "rdf_graph.add((dbo.hasrole, RDFS.domain, dbo.Person))     \n",
    "rdf_graph.add((dbo.hasrole, RDFS.range, ex.role))\n",
    "rdf_graph.add((dbp.birthCountry, RDFS.domain, dbo.Person))\n",
    "rdf_graph.add((dbp.birthCountry, RDFS.range, ex.country))\n",
    "rdf_graph.add((dbp.founding_country, RDFS.domain, dbo.Band))\n",
    "rdf_graph.add((dbp.founding_country, RDFS.range, ex.country))\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "c84075ec",
   "metadata": {},
   "source": [
    "### **`5. Materialize inferences`**\n",
    "\n",
    "Add to your KG inferences that you can make from the data on your KG (e.g., with SPARQL queries, or with OWLRL, ...).\n",
    "\n",
    "**<ins>Some</ins>**  **<ins>examples</ins>**\n",
    "- if you have that `[album] rdf:type [genre1]` and `[genre1] rdfs:subClassOf [genre2]`, add the triple `[album] rdf:type [genre2]`. Same for domains, ranges, subclasses, subproperties, OWL features, etc.\n",
    "- if the nationality of a group member is missing, you can infer it from the nationality of the band\n",
    "\n",
    "Run a few SPARQL queries on the graph to see the inferred triples.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "b30047dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "if not os.path.exists(file_path):\n",
    "    # Define the SPARQL query for constructing additional triples based on subclass relationships\n",
    "    query = '''\n",
    "      PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "      PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "      CONSTRUCT {\n",
    "          ?album rdf:type ?genre2 .\n",
    "      }\n",
    "      WHERE {\n",
    "          ?album rdf:type ?genre1 .\n",
    "          ?genre2 rdfs:subClassOf ?genre1 .\n",
    "      }\n",
    "    '''\n",
    "\n",
    "    # Prepare the SPARQL query\n",
    "    prepared_query = prepareQuery(query, initNs={\"rdf\": RDF, \"rdfs\": RDFS})\n",
    "\n",
    "    # Execute the SPARQL query on the RDF graph\n",
    "    constructed_graph = rdf_graph.query(prepared_query).graph\n",
    "\n",
    "    # Add the constructed triples to the original RDF graph\n",
    "    rdf_graph += constructed_graph\n",
    "\n",
    "    # Define the SPARQL query for inserting domain and range triples\n",
    "    sparql_query = \"\"\"\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "\n",
    "    INSERT {\n",
    "      ?something rdf:type ?type .\n",
    "    }\n",
    "    WHERE {\n",
    "      {\n",
    "        ?relation rdfs:domain ?type .\n",
    "        ?something ?relation ?withotherthing .\n",
    "      }\n",
    "      UNION\n",
    "      {\n",
    "        ?relation rdfs:range ?type .\n",
    "        ?withotherthing ?relation ?something .\n",
    "      }\n",
    "    }\n",
    "    \"\"\"\n",
    "\n",
    "    # Execute the SPARQL query and insert the types directly into the graph\n",
    "    rdf_graph.update(sparql_query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "6cd6ee75",
   "metadata": {},
   "outputs": [],
   "source": [
    "if not os.path.exists(file_path):\n",
    "  sparql_query = \"\"\"\n",
    "  PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "  PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "  SELECT  ?band ?foundingcountry ?member ?birthCountry\n",
    "  WHERE {\n",
    "    ?band rdf:type dbo:Band .\n",
    "    ?band dbp:formerBandMember ?member .\n",
    "    ?band dbp:founding_country ?foundingcountry .\n",
    "    OPTIONAL {\n",
    "      ?member dbp:birthCountry ?birthCountry .\n",
    "    }\n",
    "    FILTER NOT EXISTS { ?member dbp:birthCountry [] }\n",
    "  }\n",
    "  \"\"\"\n",
    "\n",
    "  # Execute the SPARQL query and retrieve the results\n",
    "  results = rdf_graph.query(sparql_query)\n",
    "\n",
    "  # Create a list to store the members without a country\n",
    "  members_without_country = []\n",
    "\n",
    "  # Iterate over the results\n",
    "  for result in results:\n",
    "      band = result[\"band\"]\n",
    "      founding_country = result[\"foundingcountry\"]\n",
    "      member = result[\"member\"]\n",
    "      birth_country = result[\"birthCountry\"]\n",
    "      \n",
    "\n",
    "      # Check if the former member's country is missing\n",
    "      if member is not None:\n",
    "          # Store the member in the list\n",
    "          members_without_country.append(member)\n",
    "\n",
    "  # Assign the founding country of the band to each member without a country\n",
    "  for member in members_without_country:\n",
    "      rdf_graph.add((member, dbp.birthCountry, founding_country))\n",
    "  \n",
    "  # Save the RDF graph to the TT1 file\n",
    "  rdf_graph.serialize(destination=file_path, format='turtle')\n",
    "else:\n",
    "    rdf_graph.parse(file_path, format='turtle')\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "954faa3c-172c-4bb8-8127-d90d2cb65906",
   "metadata": {},
   "source": [
    "### **`6. Query the Graph`**\n",
    "\n",
    "Query your graph in a way that:\n",
    "\n",
    "* the usefulness of having added information from dbpedia is highlighted\n",
    "* inference is exploited\n",
    "\n",
    "<b><u>Some</u></b> <b><u>examples</u></b> with the intentions:\n",
    "\n",
    "| ID | Query | Intention/insight |\n",
    "| --- | ----- | ----------------- |\n",
    "| 1 | which bands have at least one member with a different nationality? | just curiosity |\n",
    "| 2 | Which are the artist with many bands? | to spot session musicians, long-career artists, 'eclectic' artists |\n",
    "| 3 | which are the countries with more [Latin Rock](https://en.wikipedia.org/wiki/Latin_rock) bands? and what about [Black Metal](https://en.wikipedia.org/wiki/Black_metal) ? | I suppose that latin rock is more popular in Latin America countries while Black Metal in Scandinavian countries, but I may be wrong! |\n",
    "| 4 | Is there any artist who is a member of both a [Britpop](https://en.wikipedia.org/wiki/Britpop) band and a [Hip hop](https://en.wikipedia.org/wiki/Hip_hop_music) band | maybe to spot bands/artists with a strong musical contamination? e.g., [Damon Albarn](https://en.wikipedia.org/wiki/Damon_Albarn) |\n",
    "| 5 | Which is the city with more bands in absolute? and what if we consider only [Grunge](https://en.wikipedia.org/wiki/Grunge) ? | maybe to discover a music scene or just a very influential city. |\n",
    "| 6 | Give me some band/artist from the same city of [2Pac](https://en.wikipedia.org/wiki/Tupac_Shakur) | could be a way to find similar musical artists. What about adding also a time period and the musical genre? |\n",
    "| 7 | which are the bands with Argentine and Spanish members? | maybe because I love both the Argentine and Spanish sound and I hope there is something that matches both? e.g., [Los Rodriguez](https://en.wikipedia.org/wiki/Los_Rodr%C3%ADguez) |\n",
    "\n",
    "**Feel free to play and get cool insights**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "309df903",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://dbpedia.org/resource/Afro-Cuban_All_Stars\n",
      "http://dbpedia.org/resource/Agitation_Free\n",
      "http://dbpedia.org/resource/Angel_Witch\n",
      "http://dbpedia.org/resource/Armored_Saint\n",
      "http://dbpedia.org/resource/Art_Blakey_and_the_Jazz_Messengers\n",
      "http://dbpedia.org/resource/Art_Ensemble_of_Chicago\n",
      "http://dbpedia.org/resource/Ben_Folds_Five\n",
      "http://dbpedia.org/resource/Big_Big_Train\n",
      "http://dbpedia.org/resource/Black_Uhuru\n",
      "http://dbpedia.org/resource/Blind_Faith\n",
      "http://dbpedia.org/resource/British_Sea_Power\n",
      "http://dbpedia.org/resource/Buena_Vista_Social_Club\n",
      "http://dbpedia.org/resource/Camberwell_Now\n",
      "http://dbpedia.org/resource/Choking_Victim\n",
      "http://dbpedia.org/resource/Christian_Death\n",
      "http://dbpedia.org/resource/Crass\n",
      "http://dbpedia.org/resource/Deafheaven\n",
      "http://dbpedia.org/resource/Derek_and_The_Dominos\n",
      "http://dbpedia.org/resource/ELO\n",
      "http://dbpedia.org/resource/Eddie_and_the_Hot_Rods\n",
      "http://dbpedia.org/resource/Evergrey\n",
      "http://dbpedia.org/resource/Everything_Everything\n",
      "http://dbpedia.org/resource/Extol\n",
      "http://dbpedia.org/resource/Fear_Factory\n",
      "http://dbpedia.org/resource/Frightened_Rabbit\n",
      "http://dbpedia.org/resource/Gnidrolog\n",
      "http://dbpedia.org/resource/Hoodoo_Gurus\n",
      "http://dbpedia.org/resource/Huun-Huur-Tu\n",
      "http://dbpedia.org/resource/Jag_Panzer\n",
      "http://dbpedia.org/resource/Jan_Dukes_de_Grey\n",
      "http://dbpedia.org/resource/KMD\n",
      "http://dbpedia.org/resource/Lake_of_Tears\n",
      "http://dbpedia.org/resource/Leatherwolf\n",
      "http://dbpedia.org/resource/Leevi_and_the_Leavings\n",
      "http://dbpedia.org/resource/Locanda_delle_Fate\n",
      "http://dbpedia.org/resource/Malevolent_Creation\n",
      "http://dbpedia.org/resource/Matching_Mole\n",
      "http://dbpedia.org/resource/May_Blitz\n",
      "http://dbpedia.org/resource/Monster_Magnet\n",
      "http://dbpedia.org/resource/Nightwish\n",
      "http://dbpedia.org/resource/Non_Phixion\n",
      "http://dbpedia.org/resource/October_Tide\n",
      "http://dbpedia.org/resource/Orchestra_Baobab\n",
      "http://dbpedia.org/resource/Orphaned_Land\n",
      "http://dbpedia.org/resource/Os_Mutantes\n",
      "http://dbpedia.org/resource/Os_Paralamas_do_Sucesso\n",
      "http://dbpedia.org/resource/Peste_Noire\n",
      "http://dbpedia.org/resource/Portico_Quartet\n",
      "http://dbpedia.org/resource/Primal_Scream\n",
      "http://dbpedia.org/resource/Rilo_Kiley\n",
      "http://dbpedia.org/resource/Royal_Hunt\n",
      "http://dbpedia.org/resource/Rx_Bandits\n",
      "http://dbpedia.org/resource/Samla_Mammas_Manna\n",
      "http://dbpedia.org/resource/Seventh_Wonder\n",
      "http://dbpedia.org/resource/Shadow_Gallery\n",
      "http://dbpedia.org/resource/Sieges_Even\n",
      "http://dbpedia.org/resource/Siekiera\n",
      "http://dbpedia.org/resource/Simple_Minds\n",
      "http://dbpedia.org/resource/Slint\n",
      "http://dbpedia.org/resource/Social_Distortion\n",
      "http://dbpedia.org/resource/Son_Volt\n",
      "http://dbpedia.org/resource/Sons_of_Kemet\n",
      "http://dbpedia.org/resource/Spiritualized\n",
      "http://dbpedia.org/resource/Spooky_Tooth\n",
      "http://dbpedia.org/resource/Steel_Mill\n",
      "http://dbpedia.org/resource/Stiff_Little_Fingers\n",
      "http://dbpedia.org/resource/Super_Furry_Animals\n",
      "http://dbpedia.org/resource/Swell_Maps\n",
      "http://dbpedia.org/resource/Terrorizer\n",
      "http://dbpedia.org/resource/The_Congos\n",
      "http://dbpedia.org/resource/The_Cramps\n",
      "http://dbpedia.org/resource/The_Dukes_of_Stratosphear\n",
      "http://dbpedia.org/resource/The_Flower_Kings\n",
      "http://dbpedia.org/resource/The_Geto_Boys\n",
      "http://dbpedia.org/resource/The_Hellacopters\n",
      "http://dbpedia.org/resource/The_Jazz_Messengers\n",
      "http://dbpedia.org/resource/The_Knife\n",
      "http://dbpedia.org/resource/The_Loud_Family\n",
      "http://dbpedia.org/resource/The_Michael_Schenker_Group\n",
      "http://dbpedia.org/resource/The_Move\n",
      "http://dbpedia.org/resource/The_Notwist\n",
      "http://dbpedia.org/resource/The_Pop_Group\n",
      "http://dbpedia.org/resource/The_Pretenders\n",
      "http://dbpedia.org/resource/The_Prodigy\n",
      "http://dbpedia.org/resource/The_Raincoats\n",
      "http://dbpedia.org/resource/The_Ronettes\n",
      "http://dbpedia.org/resource/The_Rutles\n",
      "http://dbpedia.org/resource/The_Shins\n",
      "http://dbpedia.org/resource/The_Soft_Boys\n",
      "http://dbpedia.org/resource/The_Stranglers\n",
      "http://dbpedia.org/resource/The_Stylistics\n",
      "http://dbpedia.org/resource/The_Sweet\n",
      "http://dbpedia.org/resource/The_The\n",
      "http://dbpedia.org/resource/The_Tony_Williams_Lifetime\n",
      "http://dbpedia.org/resource/The_Wailers\n",
      "http://dbpedia.org/resource/The_Wedding_Present\n",
      "http://dbpedia.org/resource/The_Zombies\n",
      "http://dbpedia.org/resource/Theatre_of_Tragedy\n",
      "http://dbpedia.org/resource/These_Immortal_Souls\n",
      "http://dbpedia.org/resource/Thinking_Fellers_Union_Local_282\n",
      "http://dbpedia.org/resource/Tubeway_Army\n",
      "http://dbpedia.org/resource/Unida\n",
      "http://dbpedia.org/resource/Weather_Report\n",
      "http://dbpedia.org/resource/Weidorje\n",
      "http://dbpedia.org/resource/Whitesnake\n",
      "http://dbpedia.org/resource/X-Ray_Spex\n",
      "http://dbpedia.org/resource/Zamla_Mammaz_Manna\n",
      "http://dbpedia.org/resource/Arctic_Monkeys\n",
      "http://dbpedia.org/resource/At_the_Gates\n",
      "http://dbpedia.org/resource/Atomic_Rooster\n",
      "http://dbpedia.org/resource/Belle_and_Sebastian\n",
      "http://dbpedia.org/resource/Big_Black\n",
      "http://dbpedia.org/resource/Bob_Marley_and_The_Wailers\n",
      "http://dbpedia.org/resource/Crimson_Glory\n",
      "http://dbpedia.org/resource/Demolition_Hammer\n",
      "http://dbpedia.org/resource/Drive_Like_Jehu\n",
      "http://dbpedia.org/resource/Echo_and_The_Bunnymen\n",
      "http://dbpedia.org/resource/Fishmans\n",
      "http://dbpedia.org/resource/Fusion_Orchestra\n",
      "http://dbpedia.org/resource/Gorillaz\n",
      "http://dbpedia.org/resource/Hatfield_and_the_North\n",
      "http://dbpedia.org/resource/Le_Orme\n",
      "http://dbpedia.org/resource/Los_Jaivas\n",
      "http://dbpedia.org/resource/Los_Prisioneros\n",
      "http://dbpedia.org/resource/Madredeus\n",
      "http://dbpedia.org/resource/Madvillain\n",
      "http://dbpedia.org/resource/Manic_Street_Preachers\n",
      "http://dbpedia.org/resource/Mercury_Rev\n",
      "http://dbpedia.org/resource/Mobb_Deep\n",
      "http://dbpedia.org/resource/Mogwai\n",
      "http://dbpedia.org/resource/Mutantes\n",
      "http://dbpedia.org/resource/My_Chemical_Romance\n",
      "http://dbpedia.org/resource/National_Health\n",
      "http://dbpedia.org/resource/Neutral_Milk_Hotel\n",
      "http://dbpedia.org/resource/Pain_of_Salvation\n",
      "http://dbpedia.org/resource/Pantera\n",
      "http://dbpedia.org/resource/Radio_Birdman\n",
      "http://dbpedia.org/resource/Septicflesh\n",
      "http://dbpedia.org/resource/Spacemen_3\n",
      "http://dbpedia.org/resource/Streetlight_Manifesto\n",
      "http://dbpedia.org/resource/The_Dear_Hunter\n",
      "http://dbpedia.org/resource/The_Jesus_and_Mary_Chain\n",
      "http://dbpedia.org/resource/The_Lounge_Lizards\n",
      "http://dbpedia.org/resource/This_Heat\n",
      "http://dbpedia.org/resource/Uncle_Tupelo\n",
      "http://dbpedia.org/resource/Wishbone_Ash\n",
      "http://dbpedia.org/resource/AC/DC\n",
      "http://dbpedia.org/resource/Beastie_Boys\n",
      "http://dbpedia.org/resource/Boards_of_Canada\n",
      "http://dbpedia.org/resource/Buzzcocks\n",
      "http://dbpedia.org/resource/Celtic_Frost\n",
      "http://dbpedia.org/resource/Current_93\n",
      "http://dbpedia.org/resource/Edge_of_Sanity\n",
      "http://dbpedia.org/resource/Electric_Light_Orchestra\n",
      "http://dbpedia.org/resource/Fairport_Convention\n",
      "http://dbpedia.org/resource/Fleet_Foxes\n",
      "http://dbpedia.org/resource/Godflesh\n",
      "http://dbpedia.org/resource/In_Flames\n",
      "http://dbpedia.org/resource/Insomnium\n",
      "http://dbpedia.org/resource/Little_Feat\n",
      "http://dbpedia.org/resource/Los_Tres\n",
      "http://dbpedia.org/resource/Megadeth\n",
      "http://dbpedia.org/resource/Mercyful_Fate\n",
      "http://dbpedia.org/resource/Nasum\n",
      "http://dbpedia.org/resource/New_York_Dolls\n",
      "http://dbpedia.org/resource/Prefab_Sprout\n",
      "http://dbpedia.org/resource/Siouxsie_and_The_Banshees\n",
      "http://dbpedia.org/resource/Sixteen_Horsepower\n",
      "http://dbpedia.org/resource/Steeleye_Span\n",
      "http://dbpedia.org/resource/Supertramp\n",
      "http://dbpedia.org/resource/Talk_Talk\n",
      "http://dbpedia.org/resource/Teenage_Fanclub\n",
      "http://dbpedia.org/resource/Ten_Years_After\n",
      "http://dbpedia.org/resource/The_Alan_Parsons_Project\n",
      "http://dbpedia.org/resource/The_Dillinger_Escape_Plan\n",
      "http://dbpedia.org/resource/The_Moody_Blues\n",
      "http://dbpedia.org/resource/The_Pogues\n",
      "http://dbpedia.org/resource/The_Police\n",
      "http://dbpedia.org/resource/The_Waterboys\n",
      "http://dbpedia.org/resource/Tindersticks\n",
      "http://dbpedia.org/resource/Type_O_Negative\n",
      "http://dbpedia.org/resource/Weezer\n",
      "http://dbpedia.org/resource/Cardiacs\n",
      "http://dbpedia.org/resource/Dark_Tranquillity\n",
      "http://dbpedia.org/resource/Darkthrone\n",
      "http://dbpedia.org/resource/Deftones\n",
      "http://dbpedia.org/resource/Dire_Straits\n",
      "http://dbpedia.org/resource/Fleetwood_Mac\n",
      "http://dbpedia.org/resource/Gang_Starr\n",
      "http://dbpedia.org/resource/Guided_by_Voices\n",
      "http://dbpedia.org/resource/Hawkwind\n",
      "http://dbpedia.org/resource/Henry_Cow\n",
      "http://dbpedia.org/resource/Iced_Earth\n",
      "http://dbpedia.org/resource/Kamelot\n",
      "http://dbpedia.org/resource/Killing_Joke\n",
      "http://dbpedia.org/resource/Kreator\n",
      "http://dbpedia.org/resource/Massive_Attack\n",
      "http://dbpedia.org/resource/Nick_Cave_and_The_Bad_Seeds\n",
      "http://dbpedia.org/resource/Premiata_Forneria_Marconi\n",
      "http://dbpedia.org/resource/Public_Enemy\n",
      "http://dbpedia.org/resource/The_Chameleons\n",
      "http://dbpedia.org/resource/The_White_Stripes\n",
      "http://dbpedia.org/resource/Ulver\n",
      "http://dbpedia.org/resource/Badfinger\n",
      "http://dbpedia.org/resource/Cocteau_Twins\n",
      "http://dbpedia.org/resource/Dead_Can_Dance\n",
      "http://dbpedia.org/resource/Tangerine_Dream\n",
      "http://dbpedia.org/resource/The_Doors\n",
      "http://dbpedia.org/resource/The_Who\n",
      "http://dbpedia.org/resource/U2\n",
      "http://dbpedia.org/resource/Van_der_Graaf_Generator\n",
      "http://dbpedia.org/resource/Virgin_Steele\n",
      "http://dbpedia.org/resource/XTC\n",
      "http://dbpedia.org/resource/Kraftwerk\n",
      "http://dbpedia.org/resource/Led_Zeppelin\n",
      "http://dbpedia.org/resource/Marillion\n",
      "http://dbpedia.org/resource/My_Dying_Bride\n",
      "http://dbpedia.org/resource/Talking_Heads\n",
      "http://dbpedia.org/resource/The_Cure\n",
      "http://dbpedia.org/resource/Thin_Lizzy\n",
      "http://dbpedia.org/resource/Depeche_Mode\n",
      "http://dbpedia.org/resource/Judas_Priest\n",
      "http://dbpedia.org/resource/Porcupine_Tree\n",
      "http://dbpedia.org/resource/Roxy_Music\n",
      "http://dbpedia.org/resource/Stereolab\n",
      "http://dbpedia.org/resource/Iron_Maiden\n",
      "http://dbpedia.org/resource/Opeth\n",
      "http://dbpedia.org/resource/The_Smiths\n",
      "http://dbpedia.org/resource/Funkadelic\n",
      "http://dbpedia.org/resource/Black_Sabbath\n",
      "http://dbpedia.org/resource/Pink_Floyd\n"
     ]
    }
   ],
   "source": [
    "# Your solution ...\n",
    "# 1\n",
    "# Define the SPARQL query to retrieve bands with members of different nationalities\n",
    "sparql_query = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "SELECT DISTINCT ?band\n",
    "WHERE {\n",
    "  ?band rdf:type dbo:Band .\n",
    "  ?band dbp:founding_country ?foundingcountry .\n",
    "  ?band dbp:formerBandMember ?member .\n",
    "  ?member dbp:birthCountry ?birthCountry .\n",
    "  FILTER (?birthCountry != ?foundingcountry)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query and retrieve the results\n",
    "results = rdf_graph.query(sparql_query)\n",
    "\n",
    "# Iterate over the results and print the bands\n",
    "for result in results:\n",
    "    band = result[\"band\"]\n",
    "    print(band)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "a5ef8b85",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Artist: http://dbpedia.org/resource/The_Mothers_of_Invention, Number of Bands: 12, Number of own made album 12\n",
      "Artist: http://dbpedia.org/resource/Bruce_Springsteen, Number of Bands: 7, Number of own made album 7\n",
      "Artist: http://dbpedia.org/resource/Mark_Lanegan, Number of Bands: 6, Number of own made album 6\n",
      "Artist: http://dbpedia.org/resource/Sandy_Denny, Number of Bands: 6, Number of own made album 6\n",
      "Artist: http://dbpedia.org/resource/Curtis_Mayfield, Number of Bands: 5, Number of own made album 5\n",
      "Artist: http://dbpedia.org/resource/Gram_Parsons, Number of Bands: 5, Number of own made album 5\n",
      "Artist: http://dbpedia.org/resource/Brian_Eno, Number of Bands: 3, Number of own made album 3\n",
      "Artist: http://dbpedia.org/resource/Dr._Dre, Number of Bands: 3, Number of own made album 3\n",
      "Artist: http://dbpedia.org/resource/Ice_Cube, Number of Bands: 3, Number of own made album 3\n",
      "Artist: http://dbpedia.org/resource/Kamelot, Number of Bands: 3, Number of own made album 3\n",
      "Artist: http://dbpedia.org/resource/Arnaldo_Baptista, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Bunny_Wailer, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/El-P, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Jackson_Browne, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Morrissey, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Paul_Simon, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Robin_Trower, Number of Bands: 2, Number of own made album 2\n",
      "Artist: http://dbpedia.org/resource/Roky_Erickson, Number of Bands: 2, Number of own made album 2\n"
     ]
    }
   ],
   "source": [
    "#2   # I can add other relation to make artist subclass of band\n",
    "# Define the SPARQL query to retrieve artists with multiple bands/ own album\n",
    "sparql_query = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "SELECT ?artist (COUNT(?band) AS ?numBands) (COUNT(?album) AS ?numsinglealbum)\n",
    "WHERE {\n",
    "  ?album dbp:artist ?artist.\n",
    "  ?artist rdf:type dbo:Person .\n",
    "  ?band dbp:formerBandMember ?artist .\n",
    "}\n",
    "GROUP BY ?artist\n",
    "HAVING (COUNT(?band) > 1)\n",
    "ORDER BY DESC(COUNT(?band))\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query and retrieve the results\n",
    "results = rdf_graph.query(sparql_query)\n",
    "\n",
    "# Iterate over the results and print the artists with their number of bands\n",
    "for result in results:\n",
    "    artist = result[\"artist\"]\n",
    "    num_bands = result[\"numBands\"]\n",
    "    num_single_album = result['numsinglealbum']\n",
    "    print(f\"Artist: {artist}, Number of Bands: {num_bands}, Number of own made album {num_single_album}\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "b421569f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Country: http://dbpedia.org/resource/United_Kingdom, Number of Latin Rock Bands: 23\n",
      "Country: http://dbpedia.org/resource/United_States, Number of Latin Rock Bands: 20\n",
      "Country: http://dbpedia.org/resource/Australia, Number of Latin Rock Bands: 7\n",
      "Country: http://dbpedia.org/resource/Argentina, Number of Latin Rock Bands: 5\n",
      "Country: http://dbpedia.org/resource/India, Number of Latin Rock Bands: 5\n",
      "Country: http://dbpedia.org/resource/Kent, Number of Latin Rock Bands: 3\n",
      "Country: http://dbpedia.org/resource/Germany, Number of Latin Rock Bands: 2\n",
      "Country: http://dbpedia.org/resource/Brazil, Number of Latin Rock Bands: 2\n",
      "Country: http://dbpedia.org/resource/Surrey, Number of Latin Rock Bands: 1\n",
      "Country: http://dbpedia.org/resource/Italy, Number of Latin Rock Bands: 1\n",
      "Country: http://dbpedia.org/resource/Chile, Number of Latin Rock Bands: 1\n"
     ]
    }
   ],
   "source": [
    "#3 \n",
    "# Define the SPARQL query to retrieve countries with more Latin Rock bands\n",
    "sparql_query_latin_rock = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX ex: <http://example.org/>\n",
    "\n",
    "SELECT ?country (COUNT(?band) AS ?numBands)\n",
    "WHERE {\n",
    "  ?band rdf:type dbo:Band .\n",
    "  ?band dbp:founding_country ?country .\n",
    "  ?band rdf:type ex:Latin_Rock .\n",
    "}\n",
    "GROUP BY ?country\n",
    "ORDER BY DESC(COUNT(?band))\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query for Latin Rock bands and retrieve the results\n",
    "results_latin_rock = rdf_graph.query(sparql_query_latin_rock)\n",
    "\n",
    "# Iterate over the results and print the countries with their number of Latin Rock bands\n",
    "for result in results_latin_rock:\n",
    "    country = result[\"country\"]\n",
    "    num_bands = result[\"numBands\"]\n",
    "    print(f\"country: {country}, Number of Latin Rock Bands: {num_bands}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c0e68047",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Band: http://dbpedia.org/resource/Lee_Altus\n",
      "Band: http://dbpedia.org/resource/Manuel_Göttsching\n",
      "Band: http://dbpedia.org/resource/Eric_Clapton\n",
      "Band: http://dbpedia.org/resource/Ginger_Baker\n",
      "Band: http://dbpedia.org/resource/Ric_Grech\n",
      "Band: http://dbpedia.org/resource/Steve_Winwood\n",
      "Band: http://dbpedia.org/resource/Amadito_Valdés\n",
      "Band: http://dbpedia.org/resource/Lee_Dorman\n",
      "Band: http://dbpedia.org/resource/Sandy_Denny\n",
      "Band: http://dbpedia.org/resource/Trevor_Lucas\n",
      "Band: http://dbpedia.org/resource/Craig_Frost\n",
      "Band: http://dbpedia.org/resource/Dennis_Bellinger\n",
      "Band: http://dbpedia.org/resource/Mark_Farner\n",
      "Band: http://dbpedia.org/resource/Rainer_Loskand\n",
      "Band: http://dbpedia.org/resource/Bill_MacCormick\n",
      "Band: http://dbpedia.org/resource/Dave_MacRae\n",
      "Band: http://dbpedia.org/resource/Phil_Miller\n",
      "Band: http://dbpedia.org/resource/Tony_Newman_(drummer)\n",
      "Band: http://dbpedia.org/resource/Ani_Cordero\n",
      "Band: http://dbpedia.org/resource/Arnaldo_Baptista\n",
      "Band: http://dbpedia.org/resource/Zélia_Duncan\n",
      "Band: http://dbpedia.org/resource/John_Halsey_(musician)\n",
      "Band: http://dbpedia.org/resource/Ollie_Halsall\n",
      "Band: http://dbpedia.org/resource/Nicky_Hopkins\n",
      "Band: http://dbpedia.org/resource/Brendan_Canty\n",
      "Band: http://dbpedia.org/resource/Edward_Janney\n",
      "Band: http://dbpedia.org/resource/Guy_Picciotto\n",
      "Band: http://dbpedia.org/resource/Mike_Fellows_(musician)\n",
      "Band: http://dbpedia.org/resource/Greg_Drudy\n",
      "Band: http://dbpedia.org/resource/Steve_Marriott\n",
      "Band: http://dbpedia.org/resource/Matt_Cameron\n",
      "Band: http://dbpedia.org/resource/Major_Harris_(singer)\n",
      "Band: http://dbpedia.org/resource/Big_Mike_(rapper)\n",
      "Band: http://dbpedia.org/resource/Bushwick_Bill\n",
      "Band: http://dbpedia.org/resource/Scarface_(rapper)\n",
      "Band: http://dbpedia.org/resource/Willie_D\n",
      "Band: http://dbpedia.org/resource/Cameron_Brown_(musician)\n",
      "Band: http://dbpedia.org/resource/Andy_Parker_(musician)\n",
      "Band: http://dbpedia.org/resource/Cozy_Powell\n",
      "Band: http://dbpedia.org/resource/Jeff_Pilson\n",
      "Band: http://dbpedia.org/resource/Neil_Murray_(British_musician)\n",
      "Band: http://dbpedia.org/resource/Paul_Raymond_(musician)\n",
      "Band: http://dbpedia.org/resource/Billy_Bremner_(musician)\n",
      "Band: http://dbpedia.org/resource/David_Battley\n",
      "Band: http://dbpedia.org/resource/Eric_Idle\n",
      "Band: http://dbpedia.org/resource/Mickey_Simmonds\n",
      "Band: http://dbpedia.org/resource/Neil_Innes\n",
      "Band: http://dbpedia.org/resource/Russell_Thompkins_Jr.\n",
      "Band: http://dbpedia.org/resource/François_Ovide\n",
      "Band: http://dbpedia.org/resource/List_of_Whitesnake_members\n",
      "Band: http://dbpedia.org/resource/Layne_Staley\n",
      "Band: http://dbpedia.org/resource/Chuck_Mosley\n",
      "Band: http://dbpedia.org/resource/Chuck_Treece\n",
      "Band: http://dbpedia.org/resource/Sid_McCray\n",
      "Band: http://dbpedia.org/resource/Bun_E._Carlos\n",
      "Band: http://dbpedia.org/resource/Randy_Hogan_(musician)\n",
      "Band: http://dbpedia.org/resource/Jon_Drenning\n",
      "Band: http://dbpedia.org/resource/Midnight_(musician)\n",
      "Band: http://dbpedia.org/resource/Todd_La_Torre\n",
      "Band: http://dbpedia.org/resource/Rick_Froberg\n",
      "Band: http://dbpedia.org/resource/Dave_Stewart_(keyboardist)\n",
      "Band: http://dbpedia.org/resource/John_Porter_(British-Polish_musician)\n",
      "Band: http://dbpedia.org/resource/Kora_Jackowska\n",
      "Band: http://dbpedia.org/resource/Marek_Jackowski\n",
      "Band: http://dbpedia.org/resource/Lindsay_Cooper\n",
      "Band: http://dbpedia.org/resource/Mont_Campbell\n",
      "Band: http://dbpedia.org/resource/Jimmy_DeGrasso\n",
      "Band: http://dbpedia.org/resource/Josh_Freese\n",
      "Band: http://dbpedia.org/resource/Mike_Clark_(guitarist)\n",
      "Band: http://dbpedia.org/resource/Robert_Trujillo\n",
      "Band: http://dbpedia.org/resource/Rocky_George\n",
      "Band: http://dbpedia.org/resource/Thundercat_(musician)\n",
      "Band: http://dbpedia.org/resource/Garth_Hudson\n",
      "Band: http://dbpedia.org/resource/Jim_Weider\n",
      "Band: http://dbpedia.org/resource/Randy_Ciarlante\n",
      "Band: http://dbpedia.org/resource/Richard_Bell_(musician)\n",
      "Band: http://dbpedia.org/resource/Richard_Manuel\n",
      "Band: http://dbpedia.org/resource/Rick_Danko\n",
      "Band: http://dbpedia.org/resource/Stan_Szelest\n",
      "Band: http://dbpedia.org/resource/David_Tronzo\n",
      "Band: http://dbpedia.org/resource/Art_Neville\n",
      "Band: http://dbpedia.org/resource/Gareth_Williams_(English_musician)\n",
      "Band: http://dbpedia.org/resource/Victor_DeLorenzo\n",
      "Band: http://dbpedia.org/resource/Laurie_Wisefield\n",
      "Band: http://dbpedia.org/resource/List_of_Wishbone_Ash_members\n",
      "Band: http://dbpedia.org/resource/Martin_Turner\n",
      "Band: http://dbpedia.org/resource/Ted_Turner_(guitarist)\n",
      "Band: http://dbpedia.org/resource/Pascal_Humbert\n",
      "Band: http://dbpedia.org/resource/Francesco_Di_Giacomo\n",
      "Band: http://dbpedia.org/resource/Sabo_Romo\n",
      "Band: http://dbpedia.org/resource/Josh_Tillman\n",
      "Band: http://dbpedia.org/resource/Francisco_Molina_(musician)\n",
      "Band: http://dbpedia.org/resource/Ángel_Parra_Jr.\n",
      "Band: http://dbpedia.org/resource/Clinton_McKinnon_(musician)\n",
      "Band: http://dbpedia.org/resource/Theo_Lengyel\n",
      "Band: http://dbpedia.org/resource/Ontronik_Khachaturian\n",
      "Band: http://dbpedia.org/resource/David_Kitt\n",
      "Band: http://dbpedia.org/resource/Alan_Clark_(keyboardist)\n",
      "Band: http://dbpedia.org/resource/David_Knopfler\n",
      "Band: http://dbpedia.org/resource/Jack_Sonni\n",
      "Band: http://dbpedia.org/resource/John_Illsley\n",
      "Band: http://dbpedia.org/resource/Mark_Knopfler\n",
      "Band: http://dbpedia.org/resource/Pick_Withers\n",
      "Band: http://dbpedia.org/resource/Terry_Williams_(drummer)\n",
      "Band: http://dbpedia.org/resource/Geoff_Dugmore\n",
      "Band: http://dbpedia.org/resource/Martin_Atkins\n",
      "Band: http://dbpedia.org/resource/Paul_Raven_(musician)\n",
      "Band: http://dbpedia.org/resource/Graham_Maby\n",
      "Band: http://dbpedia.org/resource/Colin_Sears\n",
      "Band: http://dbpedia.org/resource/Paul_Wertico\n",
      "Band: http://dbpedia.org/resource/Paul_Haslinger\n",
      "Band: http://dbpedia.org/resource/Butch_Trucks\n",
      "Band: http://dbpedia.org/resource/Chuck_Leavell\n",
      "Band: http://dbpedia.org/resource/Derek_Trucks\n",
      "Band: http://dbpedia.org/resource/Lamar_Williams\n",
      "Band: http://dbpedia.org/resource/Marc_Quiñones\n",
      "Band: http://dbpedia.org/resource/Warren_Haynes\n",
      "Band: http://dbpedia.org/resource/Brian_Eno\n",
      "Band: http://dbpedia.org/resource/Eddie_Jobson\n",
      "Band: http://dbpedia.org/resource/Graham_Simpson_(musician)\n",
      "Band: http://dbpedia.org/resource/John_Porter_(musician,_born_1947)\n",
      "Band: http://dbpedia.org/resource/Blaze_Bayley\n",
      "Band: http://dbpedia.org/resource/Bernie_Worrell\n",
      "Band: http://dbpedia.org/resource/Eddie_Hazel\n",
      "Band: http://dbpedia.org/resource/Garry_Shider\n",
      "Band: http://dbpedia.org/resource/Jerome_Brailey\n",
      "Band: http://dbpedia.org/resource/Prakash_John\n",
      "Band: http://dbpedia.org/resource/Ruth_Copeland\n",
      "Band: http://dbpedia.org/resource/Sidney_Barnes_(musician)\n"
     ]
    }
   ],
   "source": [
    "#4\n",
    "# Define the SPARQL query to retrieve countries with more Black Metal bands\n",
    "sparql_query_black_metal = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX ex: <http://example.org/>\n",
    "\n",
    "SELECT ?country (COUNT(?band) AS ?numBands)\n",
    "WHERE {\n",
    "  ?band rdf:type dbo:Band .\n",
    "  ?band dbp:founding_country ?country .\n",
    "  ?band rdf:type ex:Black_metal .\n",
    "}\n",
    "GROUP BY ?country\n",
    "ORDER BY DESC(COUNT(?band))\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query for Black Metal bands and retrieve the results\n",
    "results_black_metal = rdf_graph.query(sparql_query_black_metal)\n",
    "\n",
    "# Iterate over the results and print the countries with their number of Black Metal bands\n",
    "for result in results_black_metal:\n",
    "    country = result[\"country\"]\n",
    "    num_bands = result[\"numBands\"]\n",
    "    print(f\"country: {country}, Number of Black Metal Bands: {num_bands}\")\n",
    "\n",
    "# Define the SPARQL query to retrieve artists who are members of both Britpop and Hip hop bands\n",
    "sparql_query = \"\"\"\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX ex: <http://example.org/>\n",
    "\n",
    "SELECT DISTINCT ?artist\n",
    "WHERE {\n",
    "  ?britpopBand dbp:formerBandMember ?artist .\n",
    "  ?hiphopBand dbp:formerBandMember ?artist .\n",
    "  ?britpopBand rdf:type ex:Britpop.\n",
    "  ?hiphopBand rdf:type ex:Hip_Hop .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query and retrieve the results\n",
    "results = rdf_graph.query(sparql_query)\n",
    "\n",
    "# Iterate over the results and print the artists\n",
    "for result in results:\n",
    "    artist = result[\"artist\"]\n",
    "    print(f\"Band: {artist}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "9a6721dd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "City with the most bands in absolute: http://dbpedia.org/resource/London_Borough_of_Camden, Band count: 42\n"
     ]
    }
   ],
   "source": [
    "#5\n",
    "# Define the SPARQL query to retrieve cities and the count of associated bands\n",
    "sparql_query = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "SELECT ?city (COUNT(?band) AS ?bandCount)\n",
    "WHERE {\n",
    "  ?band rdf:type dbo:Band .\n",
    "  ?band dbp:hometown ?city .\n",
    "}\n",
    "GROUP BY ?city\n",
    "ORDER BY DESC(?bandCount)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query and retrieve the result\n",
    "result = rdf_graph.query(sparql_query).bindings[0]\n",
    "city = result[\"city\"]\n",
    "band_count = result[\"bandCount\"]\n",
    "\n",
    "print(f\"City with the most bands in absolute: {city}, Band count: {band_count}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "c108778d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Artist/Band: http://dbpedia.org/resource/Sharon_Jones_and_The_Dap-Kings, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/The_Ronettes, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Vampire_Weekend, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Wu-Tang_Clan, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Mahavishnu_Orchestra, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Mobb_Deep, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/A_Tribe_Called_Quest, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Simon_and_Garfunkel, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Talking_Heads, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Sonic_Youth, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Adam_Yauch, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Carmine_Rojas, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Dave_Guy, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Eddie_Hazel, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Estelle_Bennett, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Havoc_(musician), with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Homer_Steinweiss, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Johnny_Ramone, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Kramer_(musician), with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Leon_Michels, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Marc_Quiñones, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Moe_Tucker, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Nedra_Talley, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Ol'_Dirty_Bastard, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/Sean_Price, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n",
      "Artist/Band: http://dbpedia.org/resource/El-P, with same birthplace/hometown: http://dbpedia.org/resource/New_York_City\n"
     ]
    }
   ],
   "source": [
    "#6\n",
    "# Define the SPARQL query to retrieve the birthplace of 2Pac\n",
    "sparql_query_birthplace = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "SELECT ?city\n",
    "WHERE {\n",
    "  <http://dbpedia.org/resource/Tupac_Shakur> dbo:birthPlace ?city .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Create a SPARQLWrapper instance and set the endpoint URL\n",
    "sparql = SPARQLWrapper(sparql_endpoint)\n",
    "\n",
    "# Set the SPARQL query string\n",
    "sparql.setQuery(sparql_query_birthplace)\n",
    "\n",
    "# Set the return format to JSON\n",
    "sparql.setReturnFormat('json')\n",
    "\n",
    "# Execute the SPARQL query and retrieve the results\n",
    "query_results = sparql.query().convert()\n",
    "\n",
    "# Extract the bindings from the query results\n",
    "bindings = query_results[\"results\"][\"bindings\"]\n",
    "\n",
    "# Extract the birthplace city of 2Pac\n",
    "birthplace_city = bindings[0][\"city\"][\"value\"] if bindings else None\n",
    "if birthplace_city:\n",
    "    # Define the SPARQL query to retrieve bands/artists from the same city as 2Pac\n",
    "    sparql_query_artists = f\"\"\"\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "    PREFIX dbp: <http://dbpedia.org/property/>\n",
    "    \n",
    "    SELECT ?artist \n",
    "    WHERE {{\n",
    "    {{\n",
    "      ?artist rdf:type dbo:Band .\n",
    "      ?artist dbp:hometown <{birthplace_city}>.\n",
    "    }}\n",
    "    UNION \n",
    "    {{\n",
    "      ?artist rdf:type dbo:Person.\n",
    "      ?artist dbp:birthPlace <{birthplace_city}>.\n",
    "    }}\n",
    "\n",
    "    }}\n",
    "    \"\"\"\n",
    "\n",
    "    # Query the SPARQL endpoint and retrieve the results\n",
    "    results = rdf_graph.query(sparql_query_artists)\n",
    "    \n",
    "\n",
    "    # Iterate over the results and print the bands/artists from the same city as 2Pac\n",
    "    for result in results:\n",
    "        artist = result[\"artist\"]\n",
    "        print(f\"Artist/Band: {artist}, with same birthplace/hometown: {birthplace_city}\")\n",
    "else:\n",
    "    print(\"Unable to determine the birthplace city of 2Pac.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "af83a44c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#7 no answer doesn't have this kind of data\n",
    "sparql_query = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "PREFIX dbr: <http://dbpedia.org/resource/>\n",
    "\n",
    "SELECT DISTINCT ?band\n",
    "WHERE {\n",
    "  ?band rdf:type dbo:Band .\n",
    "  ?band dbp:formerBandMember ?member1 .\n",
    "  ?band dbp:formerBandMember ?member2 .\n",
    "  ?member1 dbp:birthCountry dbr:Argentina .\n",
    "  ?member2 dbp:birthCountry dbr:Spain .\n",
    "  FILTER(?member1 != ?member2)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Create a SPARQLWrapper instance and set the endpoint URL\n",
    "sparql = SPARQLWrapper(sparql_endpoint)\n",
    "\n",
    "# Set the SPARQL query string\n",
    "sparql.setQuery(sparql_query)\n",
    "\n",
    "# Set the return format to JSON\n",
    "sparql.setReturnFormat('json')\n",
    "\n",
    "# Execute the SPARQL query and retrieve the results\n",
    "query_results = sparql.query().convert()\n",
    "\n",
    "# Extract the bindings from the query results\n",
    "bindings = query_results[\"results\"][\"bindings\"]\n",
    "\n",
    "# Iterate over the bindings and print the bands with Argentine and Spanish members\n",
    "for binding in bindings:\n",
    "    band = binding[\"band\"][\"value\"]\n",
    "    print(f\"Band: {band}\")"
   ]
  }
 ],
 "metadata": {
  "ipub": {
   "titlepage": {
    "author": "Authors Name",
    "email": "authors@email.com",
    "institution": [
     "Institution1",
     "Institution2"
    ],
    "subtitle": "Sub-Title",
    "supervisors": [
     "First Supervisor",
     "Second Supervisor"
    ],
    "tagline": "A tagline for the report.",
    "title": "Main-Title"
   }
  },
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
